---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportLinetypeTable
source: html/3dcac236-620c-4bd4-3800-818bd59b492a.htm
---
# ExportLinetypeTable Methods

Inserts a (key, info) pair into Export line type table.